Dlubal.RFEM5.IRib
Interface for working with rib

Dlubal.RFEM5.IRib.GetData
Gets rib parameters.
Returns: Rib parameters

Dlubal.RFEM5.IRib.SetData(System.UInt32@)
Sets rib parameters.
Rib: Rib parameters

Dlubal.RFEM5.IRib.Delete
Deletes rib.

Dlubal.RFEM5.IRib.GetRibCrossSection(System.Boolean)
Gets rib cross-section.
Returns: Rib cross-section parameters
End: If true then gets cross-section at the rib end otherwise gets cross-section at the rib start.